// 匹配不带特殊符号的文本的正则
export const reg0 = /((((https?|ftp?):(?:\/\/)?)(?:[-;:&=+$]+@)?[A-Za-z0-9.-]+|(?:www.|[-;:&=+$]+@)[A-Za-z0-9.-]+)((?:\/[+~%/.\w-_]*)?\??(?:[-?+=&;:%!/@.\w_]*)#?(?:[-+=&;%!?/@.\w_]*))?)/ig;
// 匹配带有特殊符号的文本的正则
export const reg1 = /((((https?|ftp?|http?):(?:(&#x2F;)(&#x2F;))?)(?:[-;:(&amp;)=+$]+@)?[A-Za-z0-9.-]+|(?:www.|[-;:=+$]+@)[A-Za-z0-9.-]+)((?:(&#x2F;)[+~%(&#x2F;).\w-_]*)?\??(?:[-?+=(&amp;);:%!(&#x2F;)@.\w_]*)#?(?:[-?+=(&amp;);%!(&#x2F;)@.\w_]*))?)/ig;

export const reg = /^([hH][tT]{2}[pP]:\/\/|[hH][tT]{2}[pP][sS]:\/\/|www\.)(([A-Za-z0-9-~]+)\.)+([A-Za-z0-9-~/])+$/g;

export const res = /^(https?|ftp|file):\/\/[-A-Za-z0-9+&@#/%?=~_|!:,.;]+[-A-Za-z0-9+&@#/%=~_|]$/g;

// 电话号码正则表达式（支持手机号码，3-4位区号，7-8位直播号码，1－4位分机号）
export const resTel = /((\d{11})|^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$)/;

// 身份证号(15位、18位数字)，最后一位是校验位，可能为数字或字符X
export const resCre = /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/;
